Repository: marionline/ppt2pdf
Catalog: lang/*/*.po
Languages: it

source: Usage: ppt2pdf.sh [options[argument]] [filename] options: -r: Recursive, -a: All file in this directory, -o: Overwrite existing destination file, -y: Answare YES to all question, -v: Verbose (if not use default is 1), -d: Include doc file, -e: Erase original file, -q: Ask before erasing, -j: JPEG quality (provides number 0 - 100, default 90), -h: Usage. verbose: 0 no output, 1 a little bit of info, 2 a lot of info.
it: Uso: ppt2pdf.sh [opzioni] [nome file] opzioni: -r: Ricorsivo, -a: Tutti i file nella directory, -o: Sovrascrivi file di destinazione se esiste, -y: Rispondi YES a tutte le domande, -v: Verboso (se non usato di default è 1), -d: Includere file doc, -e: Eliminare file originale, -q: Chiedi prima di cancellare, -j: Qualità JPEG (fornire un numero 0 - 100, default 90), -h: Uso. verboso: 0 no output, 1 un po' di informazioni, 2 un po' più informazioni.

source: Conversion of $FILE $DIM...
it: Conversione di $FILE $DIM...

source: Conversion finished.
it: Conversione finita.

source: Original file $FILE is $DIM size
it: File originale $FILE è di dimensione $DIM

source: Converted file $DEST_FILE is $DEST_DIM size
it: File convertito $DEST_FILE è di dimensione $DEST_DIM

source: Do you want erase $FILE?[y/...]
it: Vuoi eliminare $FILE?[y/...]

source: Erasing $FILE...
it: Eliminazione $FILE...

source: No argument passed.
it: Nessun argomento passato.

source: ERROR: JODConverter not found.
it: ERRORE: JODConverter non trovato.

source: Invalid argument '$OPTARG' passed.
it: Passato argomento '$OPTARG' non valido.

source: No argument passed to '$OPTARG' option.
it: Nessun argomento passato all'opzione '$OPTARG'.

source: Invalid option '-$OPTARG'.
it: Opzione '-$OPTARG' non valida.

source: $1 is not a file.
it: $1 non è un file.

source: \nStarting OpenOffice as a deamon...\n
it: \nAvvio OpenOffice come demone...\n

source: Enter in subdirectory: $DIR
it: Entro nella subdirectory: $DIR

source: Exit from subdirectory: $DIR
it: Esco dalla subdirectory: $DIR

source: File $DEST_FILE exist: Size is $DEST_FILE_SIZE_HUMAN
it: File $DEST_FILE esiste: dimensione di $DEST_FILE_SIZE_HUMAN

source: Original file $FILE: Size is $FILE_SIZE_HUMAN
it: File originale $FILE: dimensione di $FILE_SIZE_HUMAN

source: Convert: $FILE in pdf? [y/...]
it: Convertire: $FILE in pdf? [y/...]

source: Saved: $SCARTO $UNIT
it: Risparmiato: $SCARTO $UNIT

source: $1 is not a ppt or doc file.
it: $1 non è un file ppt o doc.

source: Total ppt files size: $TOT_PPT_SIZE MB
it: Dimensione totale file ppt: $TOT_PPT_SIZE MB

source: Total doc files size: $TOT_DOC_SIZE MB
it: Dimensione totale file doc: $TOT_DOC_SIZE MB

source: Total pdf files size: $TOT_DEST_FILE_SIZE MB
it: Dimensione totale file pdf: $TOT_DEST_FILE_SIZE MB

source: No file ppt or doc found or convert.
it: Nessun file ppt o doc trovato o convertito.

source: \nKill OpenOffice deamon...\n
it: \nUssisione demone OpenOffice...\n
